<!-- top-menu -->
<div class="top-menu">
  <div class="wrapper flex">

    <div class="top-menu__left">
      <div class="top-menu__logo">
        <a href="/">
          <img src="img/HH_logo.svg" alt="Happy House">
        </a>
      </div>


    </div>

    <div class="top-menu__right flex">
      <div class="top-menu__item">
        <a href="#" class="top-menu__link">▼</a>
        <span>Укр</span>
      </div>
      <div class="top-menu__item">
        <a href="#" class="top-menu__link">
          <svg enable-background="new 0 0 370 370" viewBox="0 0 370 370" xmlns="http://www.w3.org/2000/svg" fill="#ed1c24"><path d="m274.221 284.781c40.578-28.245 67.146-75.225 67.146-128.415 0-86.358-70.009-156.366-156.367-156.366-86.357 0-156.367 70.008-156.367 156.365 0 53.19 26.568 100.17 67.146 128.415l-37.202 38.376c-2.58 3.626-3.972 7.965-3.972 12.416v13.031c0 11.817 9.58 21.396 21.396 21.396h217.998c11.815 0 21.395-9.579 21.395-21.396v-13.031c0-4.451-1.392-8.79-3.972-12.416zm-89.221-201.398c40.309 0 72.983 32.676 72.983 72.982 0 40.307-32.674 72.983-72.983 72.983s-72.982-32.676-72.982-72.983c0-40.306 32.673-72.982 72.982-72.982zm-83.048 249.033 28.549-29.454c16.969 6.314 35.328 9.769 54.499 9.769s37.53-3.455 54.499-9.769l28.549 29.454z"/><path d="m185 201.689c25.033 0 45.322-20.291 45.322-45.324 0-16.152-8.456-30.32-21.177-38.349-.274 7.068-10.968 12.752-24.145 12.752-13.176 0-23.871-5.684-24.145-12.752-12.721 8.028-21.177 22.197-21.177 38.349 0 25.033 20.289 45.324 45.322 45.324z"/></svg>
        <span>Камера</span>
      </a>
      </div>
      <div class="top-menu__item">
        <a href="#" class="top-menu__link">
          <svg xmlns="http://www.w3.org/2000/svg" enable-background="new 0 0 440 440" viewBox="0 0 440 440" fill="#ed1c24"><path d="m421.376 46.336h-403.456c-9.728 0-17.92 8.192-17.92 17.92v310.784c0 9.728 8.192 17.92 17.92 17.92h403.456c9.728 0 17.92-8.192 17.92-17.92v-310.784c0-10.24-7.68-17.92-17.92-17.92zm-17.92 214.528-73.216-58.368c-6.656-5.12-16.384-5.12-23.04.512l-82.432 71.68-109.056-122.88c-3.584-3.584-8.704-6.144-13.824-6.144s-9.728 2.048-13.312 5.632l-52.736 57.344v-126.464h367.616z"/><path d="m219.648 92.928c-32.256 0-58.88 26.624-58.88 58.88s26.112 58.88 58.88 58.88 58.88-26.624 58.88-58.88c0-32.768-26.624-58.88-58.88-58.88z"/></svg>
        <span>Галерея</span>
      </a>
      </div>
      <div class="top-menu__item phone-number"><span class="big_letter">(044)</span> 223-16-53</div>
      <a href="#" class="top-menu__item menu__link top-menu__link" style="flex-direction: row; -webkit-flex-direction: row;">
          <svg xmlns="http://www.w3.org/2000/svg" height="45" viewBox="0 0 45 45" fill="#ffffff"><path d="m33.506 36.816c.114.27.172.544.172.822 0 .385-.102.743-.307 1.077-.204.333-.491.588-.859.764l-1.73.81c-.675.307-1.351.53-2.028.669s-1.361.209-2.053.209c-1.113 0-2.212-.185-3.298-.555s-2.125-.9-3.117-1.589-1.923-1.523-2.792-2.5c-.869-.978-1.648-2.068-2.335-3.271-.438-.667-.898-1.428-1.381-2.283-.409-.728-.876-1.6-1.402-2.617-.526-1.016-1.056-2.145-1.592-3.384-.548-1.24-.983-2.323-1.304-3.249-.321-.927-.57-1.697-.745-2.31-.205-.716-.346-1.33-.423-1.841-.282-.949-.49-1.893-.623-2.832s-.199-1.869-.199-2.789c0-1.203.121-2.36.362-3.473s.612-2.148 1.111-3.105 1.132-1.813 1.899-2.568 1.674-1.369 2.721-1.844l1.706-.785c.269-.115.539-.172.809-.172.38 0 .734.105 1.062.316.327.211.573.502.736.874l3.283 7.455c.115.27.172.54.172.81 0 .397-.102.764-.307 1.101s-.493.59-.865.758l-3.375 1.552c-.446.205-.787.505-1.025.902-.237.397-.356.824-.356 1.282 0 .348.065.675.196.982l5.541 12.653c.217.487.516.845.899 1.074.382.229.799.344 1.249.344.307 0 .62-.07.939-.209l3.375-1.552c.266-.114.534-.172.804-.172.372 0 .724.105 1.055.316s.581.5.749.868z" transform="matrix(.91538585 .41238535 -.40257762 .9376868 2.181317 -5.822241)"/></svg>
          <span>Замовити дзвінок</span>
      </a>
      <div id="menu" class="top-menu__item menu__link open-overlay">
        <span style="margin-bottom:-1px;">Меню</span>
        <span class="menu_line"></span>
        <span class="menu_line"></span>
      </div>
    </div>
  </div>
</div>
<!-- выпадающее меню -->
<div class="overlay-navigation">
  <nav role="navigation">
    <div class="main_name">
      <div class="line_grey">
        <div class="line_fanny"></div>
      </div>
      <svg height="1.011161mm" viewBox="0 0 23.316424 1.011161" width="23.316425mm" xmlns="http://www.w3.org/2000/svg" style="transform:scaleX(-1);"><g transform="translate(-10.843172 -11.709181)"><path d="m10.843172 12.209181h17.681462.310205" fill="#ee1c25" stroke="#ee1c25"/><g fill="none"><path d="m30.238531 12.220342h1.322917" stroke="#000"/><path d="m32.836681 12.218563h1.322917" stroke="#ee1c25"/></g></g></svg>
      <span>Меню</span>
      <svg height="1.011161mm" viewBox="0 0 23.316424 1.011161" width="23.316425mm" xmlns="http://www.w3.org/2000/svg"><g transform="translate(-10.843172 -11.709181)"><path d="m10.843172 12.209181h17.681462.310205" fill="#ee1c25" stroke="#ee1c25"/><g fill="none"><path d="m30.238531 12.220342h1.322917" stroke="#000"/><path d="m32.836681 12.218563h1.322917" stroke="#ee1c25"/></g></g></svg>
    </div>
    <ul>
      <li class="nav_item">
        <div class="nav_logo">
          <a href="/">
            <img src="img/HH_logo.svg" alt="Happy House">
          </a>
        </div>
        <p class="nav_name">Про проект:</p>
        <ul>
          <li><a href="#">Розташування</a></li>
          <li><a href="#">Переваги</a></li>
          <li><a href="#">Цінності</a></li>
          <li><a href="#">Архітектура</a></li>
          <li><a href="#">Інфраструктура</a></li>
          <li><a href="#">Контакти</a></li>
        </ul>
      </li>
      <li class="nav_item">
        <p class="nav_name">Обрати квартиру</p>
        <ul>
          <li><a href="#">Всі квартири</a></li>
          <li><a href="#">1-кімнатні</a></li>
          <li><a href="#">2-кімнатні</a></li>
          <li><a href="#">3-кімнатні</a></li>
          <li><a href="#">4-кімнатні</a></li>
          <li><a href="#">Розстрочка</a></li>
          <li><a href="#">Коммерційна нерухомість</a></li>
          <li><a href="#">Юридична інформація</a></li>
        </ul>
      </li>
      <li class="nav_item">
        <p class="nav_name">Хід проекту</p>
        <ul>
          <li><a href="#">Забудовник</a></li>
          <li><a href="#">Хід будівництва</a></li>
          <li><a href="#">Веб-камера</a></li>

        </ul>
      </li>
      <li class="nav_item">
        <p class="nav_name">Контакти</p>
        <ul>
          <li>Київ, Бориспільська траса, 252 А</li>
          <li>метро Бориспільська</li>
          <li>
            <div class="phone_box">
              <div class="flex">
                <svg xmlns="http://www.w3.org/2000/svg" height="24" width="18" viewBox="0 0 45 45" fill="#c8c8c8"><path d="m33.506 36.816c.114.27.172.544.172.822 0 .385-.102.743-.307 1.077-.204.333-.491.588-.859.764l-1.73.81c-.675.307-1.351.53-2.028.669s-1.361.209-2.053.209c-1.113 0-2.212-.185-3.298-.555s-2.125-.9-3.117-1.589-1.923-1.523-2.792-2.5c-.869-.978-1.648-2.068-2.335-3.271-.438-.667-.898-1.428-1.381-2.283-.409-.728-.876-1.6-1.402-2.617-.526-1.016-1.056-2.145-1.592-3.384-.548-1.24-.983-2.323-1.304-3.249-.321-.927-.57-1.697-.745-2.31-.205-.716-.346-1.33-.423-1.841-.282-.949-.49-1.893-.623-2.832s-.199-1.869-.199-2.789c0-1.203.121-2.36.362-3.473s.612-2.148 1.111-3.105 1.132-1.813 1.899-2.568 1.674-1.369 2.721-1.844l1.706-.785c.269-.115.539-.172.809-.172.38 0 .734.105 1.062.316.327.211.573.502.736.874l3.283 7.455c.115.27.172.54.172.81 0 .397-.102.764-.307 1.101s-.493.59-.865.758l-3.375 1.552c-.446.205-.787.505-1.025.902-.237.397-.356.824-.356 1.282 0 .348.065.675.196.982l5.541 12.653c.217.487.516.845.899 1.074.382.229.799.344 1.249.344.307 0 .62-.07.939-.209l3.375-1.552c.266-.114.534-.172.804-.172.372 0 .724.105 1.055.316s.581.5.749.868z" transform="matrix(.91538585 .41238535 -.40257762 .9376868 2.181317 -5.822241)"/></svg>
                <div><span class="">(044)</span> 222-22-33</div>
              </div>
              <a href="#">Замовити дзвінок</a>
            </div>
          </li>
        </ul>
      </li>
    </ul>
    <div class="close_btn open-overlay">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 50 50" width="50" height="50"><path d="M37.304 11.282l1.414 1.414-26.022 26.02-1.414-1.413z" fill="#ed1c24"></path><path d="M12.696 11.282l26.022 26.02-1.414 1.415-26.022-26.02z" fill="#ed1c24"></path></svg>
    </div>
  </nav>
</div>
<!-- end top-menu -->
